InformationRegisters/бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодСравнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг/Forms/ФормаРедактирования/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура ОбновитьТаблицы(Дата,Организация)
	
	СписокУслуг.Очистить();
	
	Запрос = Новый Запрос;
	
	// Услуги.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УслугиЖКХ.Ссылка КАК Услуга,
	|	бит_УслугиЖКХ.ГруппаУслуги КАК ГруппаУслуги,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Начислять,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы
	|ИЗ
	|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СрезПоследних(&Дата, Организация = &Организация) КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
	|		ПО (бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга = бит_УслугиЖКХ.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаУслуги,
	|	Услуга";
	
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	СписокУслуг.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуИЗапись(Записать = Ложь)
	
	ОтказОтЗаписи = Ложь;
	
	Для Каждого СтрокаУслуг Из СписокУслуг Цикл
		
		Если СтрокаУслуг.Начислять И (СтрокаУслуг.ПериодСравнения = Дата(1,1,1)) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данные не записаны!!!" + Символы.ПС +
			                  "Заполните значение ""Период сравнения"" у услуги " + СтрокаУслуг.Услуга;
			Сообщение.Сообщить();

			ОтказОтЗаписи = Истина;
						
		КонецЕсли;
	
	КонецЦикла;
	
	Если Не ОтказОтЗаписи Тогда
		
		Для Каждого СтрокаУслуг Из СписокУслуг Цикл
			
			НаборЗаписей = РегистрыСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Услуга.Установить(СтрокаУслуг.Услуга, Истина);
			НаборЗаписей.Отбор.Организация.Установить(ОрганизацияЗапроса, Истина);
			НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(ДатаЗапроса), Истина);
			
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Запись = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(Запись, СтрокаУслуг);
			
			Запись.Организация                                         = ОрганизацияЗапроса;
			Запись.Период                                              = НачалоМесяца(ДатаЗапроса);
			Запись.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы = СтрокаУслуг.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы;
			Запись.ПериодСравнения                                     = НачалоМесяца(СтрокаУслуг.ПериодСравнения);
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодСравнения()
	
	Для Каждого СтрокаУслуг Из СписокУслуг Цикл
		
		СтрокаУслуг.ПериодСравнения = ДатаПериодаСравнения;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаЗапроса          = ТекущаяДата();
	ОрганизацияЗапроса   = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	ДатаПериодаСравнения = Дата(1,1,1);
	
	ОбновитьТаблицы(ДатаЗапроса,ОрганизацияЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ВыполнитьПроверкуИЗапись();
	
	Если Не ОтказОтЗаписи Тогда
		
	    Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ВыполнитьПроверкуИЗапись();
	
	Если Не ОтказОтЗаписи Тогда
		
	    ОбновитьТаблицы(ДатаЗапроса,ОрганизацияЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьТаблицы(ДатаЗапроса,ОрганизацияЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериодСравнения(Команда)
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("ЗаполнитьПериодСравненияЗавершение", ЭтотОбъект, Новый Структура("ДатаПериодаСравнения", ДатаПериодаСравнения)), ДатаПериодаСравнения, НСтр("ru = 'Введите дату периода сравнения'"),ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериодСравненияЗавершение(Дата, ДополнительныеПараметры) Экспорт
    
    ДатаПериодаСравнения = ?(Дата = Неопределено, ДополнительныеПараметры.ДатаПериодаСравнения, Дата);
    
    ОбновитьПериодСравнения();

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаЗапросаПриИзменении(Элемент)
	
	ОбновитьТаблицы(ДатаЗапроса,ОрганизацияЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияЗапросаПриИзменении(Элемент)
	
	ОбновитьТаблицы(ДатаЗапроса,ОрганизацияЗапроса);
	
КонецПроцедуры

#КонецОбласти
